[{"body": "Hello! This is just a quick reminder for new friendos to [read our subreddit rules.](http://www.reddit.com/r/wholesomememes/about/sidebar)\r\n\r\n&gt;**Rule 4:** Please do not troll, harass, or be generally rude to your fellow users.\r\n\r\nWe're trusting you to be wholesome while in /r/wholesomememes, so please don't let us down. We believe in you!\r\n\r\n^(Please stop by the rest of the) [^Wholesome ^Network ^Of ^Subreddits](http://www.reddit.com/u/awkwardtheturtle/m/wholesome)  ^also.\r\n\r\n"
},                       
{"body": "My 1 word of advice is to find a great care facility who really cares about your dad, and everything will be a lot better. Got 2 grandpas in this small home about an hour away and while they are both succumbing to illness it helps to knowntheyre being cared for by people who have the ability to while they live out their last days (if that’s the case with your dad, it may be nothing cause 62 seems pretty early)"
},                                                                                                                                               
{"body": "❤️ will do! "
},                                                                                                                           
{"body": "Parenting is teamwork. Sometimes, Mum is pissed, so Dad plays chill, but doesn't contradict Mum. Sometimes, the roles reverse.\n\nIn the end, they both love you more than life. They are still people, though."
},                                                                                                                           
{"body": "Maybe it's me, but I've noticed dad's often complement moms. If the mom is chill, dad is intense, and if the mom is hardcore, dad will be the chillest dude ever.\nI hope you have lots of great moments with him, he sounds like a great guy.\nTell him the internet thinks he's cool."
},                                                                                                       
{"body": "When I came out to my parents, my (abusive) mother screamed at me for two hours. My dad is my best friend, always has been. At that moment he said “your mom seems upset but I need you to know it’s harder for you than it is for her.”\nNow I try to keep it in mind. It’s painful and it’s frustrating to watch him fall apart but I need to be patient and strong because it’s harder for him than for me"
},                                                                                   
{"body": "I'm sure it's damn tough. Hang in there.\nI have an uncle who told me this story:\nHis mother has Alzheimer's. She's in a care home.\nThere's an old Italian dude who comes and gives all these old ladies roses.\nThe best part is they are happy for an instant, and while he gives roses to the other women, since most of them forget very quickly, none of them feel like he's hitting on every woman.\nIt's so hilarious, yet simply effective. Everyone's happy, no one feels jealous.\n\nGood luck to your dad. Cherish every moment with him, I couldn't."
},                                                               
{"body": "I'm so sorry. I'm going through the same thing. My dad is also 62, and also won't see a doctor in case it's bad news. It sucks."
},                                                               
{"body": "There are other causes of dementia such as vitamin b12 deficiency and thyroid problems that can be treated. Please get him to a doctor. "
},                                                               
{"body": "I think my dad has alzheimer’s. I’m so afraid. Hes only 62 but he’s retiring because he can’t complete long term projects. He doesn’t want to go to the doctor because if it’s terminal he doesn’t want to know. I told him it could be something easily fixable and he trusted me and now he’s going. Can’t handle it. I know he’s going to call me every day and ask the same questions cause he’s done it before during a period of time when he was anxious. And if he’s scared about dying and about alzheimer’s every day he will call and ask about it and I can’t make him feel any better because he’ll forget what I’ve told him "
},                                           
{"body": "He is."
},                                                                                   
{"body": "Your dad sounds like an ****"
},                                                               
{"body": "Why did I come to this thread again? "
},                                                                                                                                               
{"body": "And eventually death will take away all of our memories for good."
},                                                                                                                           
{"body": "If we want to be pedantic and cynical, sure. You can suffer from memory loss in many, many ways even at a young age. Depending how it happens you may remember of the memory loss, or don't even understand what is going on.\n\nAlzheimer's is devastating for everyone involved and it changes who's left behind with the smoke and ashes. You can decide to let this tragedy destroy you too, or keep going with your life and look for happiness in what you still have."
},                                                                                                       
{"body": "You literally can be robbed of the good memories though."
},                                                                                   
{"body": "I know how it feels.\n\nThese things change us deeply, but you have to stay focused on your life. When the mind slips away, there's nothing you can di but accept it. Life is unfair, but don't let it keep you down in the puddle of mud. Get up and take it on, no one can rob you the good memories."
},                                                               
{"body": "the day my Mom look so confused when my Dad stood there pointing at me; asking my Mom over and over if she knew who I was. \n\nthen he says: \"This is my  new girlfriend. I went out and found a new girlfriend so I can trade you in.\" She knew my Dad but had just forgot who I was. He always threatened and harassed her for many years that he was going to go out and find a 25 year old. It just ****ing hurt her so bad. She died almost 2 years ago.\n\nTonight, I just went to visit my Dad at the assisted living and all his older lady friends were there. One that I hadn't met pipes up and says: \"I see you finally brought your girlfriend around.\"\n\nI am ready to quit at life. \n\nNone of Alzheimers is anything positive. None of it. I'm sorry your Gram was afflicted with that awful disease. "
},                                           
{"body": "My mom has been calling me by my brother’s name for 30 years. I’m 32. It’s just a thing that happens. Hell, I can’t even get my dog’s names straight half the time. "
},                                                               
{"body": "The day my grandad called me by my sister’s name was the worst.  You know they can’t help it but it hurts all the same."
},                                           
{"body": "I also lost my grandfather last year, but it felt like he had been gone for years before. I will never forget the time I came to visit and he shook my hand and said \"nice to meet you\". It really threw me off because I didn't realize how much of him was gone by that point. \n\nThank you for sharing. Alzheimer's is heart breaking and I appreciate you telling us about your grandmother."
},                                           
{"body": "At first i thought this meme was a chili peppers “by the way” pho pun.... then i read down and now it’s 6:45 AM and I can’t stop thinking about how much i miss my grandpa. Alzheimer’s sucks and is the saddest. Before he passed, he told me the same story three times in a row within one hour. I just smiled and nodded because he was the best story teller i ever met. "
},                                           
{"body": "Had a very similar experience with my grandma. We were super close until we couldn’t be. Carry her love on for other people to experience! "
},                                           
{"body": "Stay wholesome, yo"
},                                                               
{"body": "&gt; I’ll never forget when Alzheimer’s really set in. \n\nI mean..."
},                                           
{"body": "My grandma is entering stage 3 of dementia.. and she is like my mom. \nI'm selfishly not at a ready for this stage yet, and when I read your story I pictured it happening so easily and I just... broke. \nIt's strange to miss someone so deeply that's alive. \nI'm so sorry for your loss. It would be so difficult to not get emotional because that would only hurt her and cause confusion. Do you think photos with labels help?"
},                                           
{"body": "I remember my grandmother and I having a nice conversation about the weather and when I left to get her water, I heard her ask the nurse who I was. That was when I started to cry. She knew she had dementia and hid it so well for my already ailing grandfather. I feel for your loss. "
},                                           
{"body": "I’ll never forget when Alzheimer’s really set in.\nI went to my grandmas with my mom. She was helping her move her stuff to an Assisted Living home. I was standing in the hallway and my grandma turned around and asked my mom, “you can tell your friend to come in.”\nI had to do my best to not get emotional. She used to call me Sunny because I was her ray of sunshine. She died last year. "
},                       
{"body": "that's the most beautiful thing I've seen in a long time"
},                                                                                   
{"body": "This is a big thing, without a doubt."
},                                                                                   
{"body": "My Grandfather had cancer at 93 that metastasized to his brain.  The last time I saw him I introduced him to my son his great-greatgrandson.   I know its a little thing and useless in the great wide world.  In that moment I had made him the happiest man in the [world](https://imgur.com/6FmsLyg).  "
},                                                               
{"body": "I'm so glad that you had that moment."
},                                           
{"body": "Your 8 year old self did a really good job. You were kind and should be proud of little you."
},                                                               
{"body": "Ah, the stranger "
},                                                                                   
{"body": "It's been proven that doing things with your non dominant hand reduces your risk for alzheimers. It's never too late to try and combat it, especially being so prevalent in your family. "
},                                                               
{"body": "About a month or so after my grandfather died of natural causes, we were visiting my grandma who was in the later stages of her Alzheimer's. At one point, it was just me and her in the kitchen, and she asked me \"When is Paul (my grandfather) coming home?\" with a distressed look on her face. My 8 year old self couldn't bear to remind her of the truth, and said \"i dont know\" while hiding my tears.\n\n**** Alzheimer's. It is absolutely my biggest nightmare. 3/4 of my grandparents have had it, and the last one is at risk for it still. I have a **** memory already, so if/when I develop Alzheimer's, I will lose all purpose as a human"
},                                           
{"body": "That’s incredible that you were able to make it fun for him when these are usually really tough times for all parties involved. This is really touching thanks for sharing "
},                                                               
{"body": "My grandfather passed from Alzheimer’s as well. \n\nWe had a big family gathering a year before or so and he had the best time ever. He didn’t know who anyone was, but he knew we were all family and it was like he was meeting people for the first time and he was genuinely happy. "
},                                           
{"body": "My neighbour was really more of a grand father to me growing up. When his memory went he couldn’t quite figure out who me and my dad were. So he just lumped us in with his kids and grandkids aka “the boys”. That was a lot of feels. "
},                                           
{"body": "Same dude. Crying on an Uber ride. I was always the only grandchild who’d visit them when I was younger and subsequently their favorite. Now that grandpa can’t remember me, it’s hard to justify visiting now that I’ve moved 400 miles away. I don’t think I’ve missed anyone since I moved away three months ago until I saw this post. "
},                                                               
{"body": "Aw **** now I’m crying on the bus "
},                                           
{"body": "My grandad had Alzheimer’s and he had pictures of us and he replaced mine with a picture of his dog ha "
},                                           
{"body": "Ohh man. My grandmother also died of Alzheimer's. While she still maintained some capacity to recognize people, we couldn't tell if she mistook me for my father or not: my father was her first child, I was her first grandchild, and I look eerily similar to my father at that age. But man, when I tried conversing with her in the weeks before she passed, you could just sense the recognition in her eyes. "
},                                           
{"body": "I’m so sorry.  This just broke my heart."
},                                           
{"body": "That's a beautiful ****ing story."
},                                           
{"body": "My grandfather died of Alzheimer's. Towards the end, he couldn't even remember that his wife had died. He kept going to the police station to report her missing. \n\nI visited him a few months before he passed. It was evident he had no idea who I was. I left thinking he would never remember me. \n\nAfter he died, I found a portrait of me on his nightstand. I've never cried so hard."
},                       
{"body": "dude I cried for the entire last 20 minutes of that movie and then at home"
},                                                                                                       
{"body": "I lost my mom to Dementia last year and I hadn’t been able to cry since. I was watching CoCo in the theater and I sobbed thru the last half hour. I cried for my mom and I cried for myself. "
},                                                                                                       
{"body": "Man, dementia sucks. I think my dad got it from playing high school football. He died three months ago from getting hit by a semi, apparently, because walking down a dark highway at night seemed like an okay thing to do.\n\nIt’s a hard thing, his loss. But at the same time, it’s made easy by the fact that if he were alive right now, the experience for all involved would be worse. (When my dad was diagnosed, the doctor noted that he cried when he realized he was unable to recollect simple things.) \n\nI grieve with you all."
},                                                                                                                           
{"body": "holy **** my dads 62 and I was holding onto hope that it might be something other than alzheimer’s cause he’s young. well ****"
},                                                                                                                           
{"body": "and also I hope that your husband recovers well- Im sure you’ll be there to support him but I also hope he doesn’t rely solely on you and that he has an extensive network of professionals and loved ones to help "
},                                                                                                                           
{"body": "oh jeez thanks for the heads up. my husband's dad has dementia and is getting worse every few months (like that stall out then drop, stall out then drop thing it does). He went from being clumsy and cutely forgetful to full on now in adult diapers and a care home within 3 years. He is only 65 and we noticed in on setting when he was around 58 and he came to live with us for a few years because he couldnt remember to put the shopping away when he bought food or wash his clothes or feed his dog. Before this it was just stuff like forgetting he told us what he saw on tv and repeating the story again and again, or sometimes stuttering because he forgot what he was going to say as he started to talk (a lot of people do this but it became often enough we thought we better have a psychologist talk to him who diagnosed him with early onset dementia). It is just getting worse now more quickly. Like a roll of paper towels reaching the end. There is less to lose so each loss is more severe (i know people use this as an analogy for weight loss but i feel like its also relevant here). \n\ni might actually not make him watch this because it could wreck him. he and his dad were really close and now we are living on the other side of the world and his dad is in a care home near his older brother."
},                                                                                                       
{"body": "Thank you."
},                                                                                                                                               
{"body": "Deepest sympathies for your loss, my friend. \\*internet hug*"
},                                                                                                                           
{"body": "Same here. First plane flight ever three weeks ago and I was crying midway through it because Coco reminded me of my great grandmother who passed two weeks prior."
},                                                                                                       
{"body": "I’m pregnant with my first and missing my grandma who would have been extremely excited... so thanks for the heads up, ill just wait a few months on that"
},                                                                                                       
{"body": "Thankyouuuu! We are VERY excited. "
},                                                                                                                                               
{"body": "Congrats on the small human "
},                                                                                                                           
{"body": "I was on a flight a couple weeks ago and wanted to watch something fun and light hearted so I chose Coco. Fast forward to one hour later and I'm ugly crying while asking the flight attendant for extra napkins to dry my eyes and blow my nose with. Such a good movie.\n"
},                                                                                   
{"body": "Coco deals with this! watch that"
},                                                               
{"body": "Let me be the first on this comment train to wish you the best, without any emoji talk. This actually is a very beautiful way to put it to children, painful as it is to deal with. Good luck to you.\n\nAnd use your emoji's any damn way you want to."
},                                           
{"body": "Sure, but if Dory was angry and even violent, then she wouldn't be representative of the Alzheimer's patients who are docile. (And there are plenty of those, including my late grandmother.)\n\nNo one character can perfectly represent *everyone* that shares a certain trait. That's not a flaw in the representation; it's just how the world works. (And there are lots of folks with memory issues and/or dementia who *don't* have Alzheimer's that Dory also represents, by the by.)"
},                                                                                   
{"body": "As you are the primary individual that will remember and thus live with your choice, I hope you did whatever you felt best. And I hope time lessens the sting of regret if you didn't."
},                                                                                                                           
{"body": "Definitely a tough situation, feel that way with my grandpa right now."
},                                                                                                                           
{"body": "True.  In my personal situation, the later stages is all my kid had.  My grandmother already had Alzheimer’s when he was born and it was well progressed when he was older.  She never understood that she had a great grandchild.  Do you even bother introducing the child to a person that can’t form a relationship or do you basically write the relative off as dead?  It’s a cruel disease, teasing you with the life of a loved one.  Honestly, her last 3 years alive were pointless.  She wasn’t in there at all, she was a zombie like creature only alive on technicalities.  I don’t know what my point is anymore and I’m just rambling..."
},                                                                                                       
{"body": "&gt; Dory was nice and cheerful every time she was reintroduced. Alzheimer’s often become angry and even violent.\n\nYes, but you aren't exactly just tumbling through it all, forcing young children to witness it.   You have to come up with an exit strategy and monitor the situation.   It's already incredibly tough to explain the progression of a degenerative disease to young children.   To force them to witness these later stages would be unkind - and not something the grandparent would even want for their grandchild.  They want to leave a legacy of pleasant memories, and as little trauma as possible for the youngest members of the family.\n\n"
},                                                                                   
{"body": "just out of curiousity, how do you think personality plays into symptoms? \n\nMy grandma was very fiesty and independant back in the day, and when she started deteriorating, things got bad. She was often angry at being confused and would frequently get into arguments. \n\nIts like she was aware enough to understand that her independance was being limited and frustrated with the world because od that"
},                                                                                                                           
{"body": "That or they’re not being treated well, on the wrong meds, or have a UTI (but I’m sure you already know that, preaching to the choir). "
},                                                                                                                           
{"body": "This!  More often than not, the ones who are extremely combative and agitated have frontotemporal lobe dementia.  This is generally genetic and has much earlier onset (50-60 years old), and affects emotions, behaviors and personality.  They swing from aggressive and hitting to emotional and teary.\n\nSource: am nurse"
},                                                                                                       
{"body": "No not often. There are plenty of those we in medicine call “pleasantly confused”. Alzheimer’s does not automatically mean agitated and combative, it is a possible symptom, but not guaranteed. "
},                                                                                   
{"body": "I've had multiple family members with Alzheimers, and this is accurate. My grandmother was fairly tame. She'd forget who people were, where she was, etc, but she never lashed out from what I saw. She was also fairly young; she was in her late 50's when she was diagnosed.\n\nMy great grandfather, however, was a little violent. He'd threaten my great aunt from time to time. He died shortly after being diagnosed, though. "
},                                                                                                                           
{"body": "Friend of mine works on a dementia ward (most patients there have alzhemiers when emitted) and she told me, not all but many are rude/mean but only a few are actually violent (one guy tried to stab her and some other nurses with a pen)"
},                                                                                                       
{"body": "This can be often related to medications. Not all the time, but it is a tough thing to try to slow the disease and make them comfortable. "
},                                                                                   
{"body": "Maybe, but it isn’t the most accurate example.  Dory was nice and cheerful every time she was reintroduced.  Alzheimer’s often become angry and even violent."
},                                                               
{"body": "this is what people are talking about when they say \"we need representation in media\"\n\nnow it serves as an example to normalize something like Alzheimer's, something previously difficult to talk about or explain, especially to kids or anyone who doesn't understand it."
},                                           
{"body": "she doesn’t really remember unless you mean after her death- she does have a moment of clarity which may misrepresent alzheimer’s. I think what’s important thematically is the entire time the father thought she was forgetting because she hated him when in reality she loved him all along. That’s really the message. It also deals with the heart breaking aspects of memory loss- your own life ripped away from you, your experiences disintegrate and vanish forever. we are taught to make use of our suffering and learn and grow from our experiences, but how can we when they are stolen by this disease. alzheimer’s is meaningless suffering and it’s tragic. In that way it makes you think about death, loss of self, and it simultaneously reminds us that after death our legacy lives on while also acknowledging that everyone someday dies and is forgotten. I mean seriously the afterlife in that movie is not eternal. I don’t know it really hit home for me"
},                                                                                   
{"body": "also things like smell and song can really awaken memories through a separate route in the brain, allegedly. They evoke nostalgia (typically through the orbitoprefrontal cortex but also I study pain not the brain so don’t quote me on this) and that feeling, although somewhat vague, can help us to remember things. Some alzheimer’s patience have music as part of their treatment- it can serve as cues for them to go about their day and they can focus more easily on the task with the rhythm of the song- same with parkinson’s \n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC2914108/\nhere’s one study also the mayo clinic mentions it may be beneficial "
},                                                                                   
{"body": "Except Coco painfully misrepresents Alzheimer's. The grandma suddenly remembered everything in the end. That's just giving kids false hope."
},                                                               
{"body": "i’ll recommend coco"
},                                           
{"body": "I've always said that if the day ever comes that I'm diagnosed with Alzheimer's I want it to be know that I wish for a DNR. Two of my grandparents had it.\n\nAlthough it wasn't as bad as most horror stories (my grandfather would still say \"there's the most beautiful woman in the world\" every time my grandma entered the room) it was still horrific to see.\n\nAlzheimers is truly the death of self before the body goes."
},                                                               
{"body": "As much as this may not seem wholesome, I hope that whoever it is doesn't last long, for their sake and that of their loved ones. My Grandfather lived for decades with Alzheimer's. It was like watching him rot away, mind and body, while he was still alive. By the end, he could barely recognize his own children, and had forgotten that his wife had passed a decade prior (after previously forgetting what she looked like while she was still alive).\n\nIt's not a fate I'd wish on anyone."
},                                           
{"body": "This made me teary. I'll have to have this explanation soon with my kids, and this is a great way to put it 😪"
},                       
{"body": "&gt; Reddit made me cry again. \n\nReddit seems to do a good job of making me tear up every now and again.  Hugs to you, friend."
},                                                                                   
{"body": "Very true. My mom didn’t have Alzheimer’s but she did develop dementia from cancer.  \n\nReddit made me cry again. "
},                                                               
{"body": "My grandfather suffered Alzheimer’s and forgot my grandma, they were married for 59 years. My grandmothers’ favorite memory of him that way was when they were bringing him home from the hospital and he looked at her and said, “You know those sons of ****es tied me up Hortense?” \n\nBefore she could respond he was gone again. "
},                                                               
{"body": "Man. This brought back the memory of my grandfather the day before he passed away. He was in a hospital style bed in my grandparents old room and I went in to say goodbye. And he legit sat up and gave me the biggest hug and kiss I’d ever gotten. I couldn’t even say words i just cried. I’ll never forget that moment"
},                                                               
{"body": "This entire thread is ****ing me up"
},                                                                                   
{"body": "This made me emotional.  Not gonna lie."
},                                                               
{"body": "It was exactly the same for me. I saw him for the last time, and he squeezed my hand, recognizing me. He was gone just a few hours later."
},                                                               
{"body": "I feel for you. I was the last of the family to see my grandma alive. We went to see her in intensive care, the three granddaughters. She held my hand and told us she was sorry she couldnt receive us better (typical!!). I told her i would be back tomorrow... i also went to see the nurse to say she was feeling very bad and could they go check on her. \n\nIt’s a sad last memory but at least i have it... \n\n(Also i am pregnant with my first so here come all the feels ) "
},                                                               
{"body": "My grandfather didn’t have Alzheimers but cancer had spread over his body and he, in his final days, became delusional and incapable of speech. I still remember on one of his last days i grabbed his hand whilst he spewed out death rattles. He took a moment of brief lucidity to stop, and squeeze my hands; and he was gone as quick as he came. \n\nHe was still in there. Still filled with love for me. \n\nI’m sorry for your grandfathers Alzheimers. Just remember he’s still in there with just as much love as he’s always had for you. Cherish the time you had with him, for it could be less. \n\nStay strong. Prayers with you and your fam"
},                                           
{"body": "I’m in the same boat. My grandpa knows we’re related but has no idea who I am. However, he still seems to enjoy my company so that’s something."
},                                           
{"body": "Lost my mom to early onset Alzheimer’s just a few years ago. This has hit me hard especially since I was already struggling with wanting to call her today and tell her I miss and love her. \n\n**** a bunch of Alzheimer’s. "
},                                           
{"body": "Alzheimers is a really weird disease. My grandmother had it for a VERY long time before passing, but one of the most interesting things that I will always remember and emphasizes the point of this post really well was an interaction my mom had with her one weekend when I was home from college.\n\nI had been dating my girlfriend for well over a year at the time, and she was my first girlfriend. When we started dating my grandmother's memory was gone with the exception of her children for the most part. She's sometimes act like she remembered me or my sister, but you could never tell if she remembered you or that was her \"polite southern upbringing\" that stayed with her almost up until she past. Anyway, one weekend I came home from college by myself, which normally my girlfriend would come along. Sometime in Saturday afternoon my grandmother pulled my mother aside and quietly pointed at me and said, \"where's the girl... She's a nice girl.\" My mom was completely confused at first, but finally suspected she was talking about my girlfriend, which there is no reason she should have any memory of. After some round about questions, she determined that was exactly who she was asking about and assured her that we were still together and she just hasn't come to town that weekend, which reassured her enough that it came back up from time to time, but my mom knew what she was asking and what to tell her. \n\nI don't know if she remembered who I was most of the time, but somehow through the disease she had made a memory of my girlfriend, now wife. She didn't know her name, she couldn't get out more than \"that girl\" but she knew that she was important/connected to me, and was concerned enough to ask when she wasn't around. It didn't last, but moments like that were what made all the hardship of being my grandmother's care take worth it for my mom. Enjoy their company while they're around. They may remember more than they're capable of expressing, and even once we were forgotten, she always enjoyed sitting with us and talking anyway. "
},                                           
{"body": "My grandmother recently passed away after living with alzheimer's for a while. I think the worst part was watching my dad slowly lose his mom to that god-awful disease."
},                                           
{"body": "I lost my grandmother to it when I was 17. It was painful to see her mind slip away, but she did so much to make me the person I am today and that experience was part of it.\n\nAll my hugs to you and your grandpa! &lt;3"
},                                           
{"body": "My grandma has Alzheimer's, and she doesn't recognize ANYBODY at this point. **** Alzheimers, so hard. Has to be one of the worst things to happen to anybody, let alone their family and loved ones."
},                                           
{"body": "My grandfather has Alzheimer’s, this hit really close to home but it’s very heartwarming"
},                       
{"body": "It doesn't mean he loves us any less!"
},                                                               
{"body": "Your services will no longer be needed as we are terminating the position."
},                                                               
{"body": "Thank you for your contributions to comedy."
},                                           
{"body": "Hey, fuh-queue too man."
},                                                                                                       
{"body": "I thought it was \"puh\""
},                                                                                                       
{"body": "Pho is pronounced as “fuh”\n\nSo essentially, “Fuh-queue”"
},                                                                                   
{"body": "It would be \"Fuh-Q\"."
},                                                                                   
{"body": "Foe-kew right?! :)"
},                                                               
{"body": "As long as you're pronouncing it right :))"
},                                           
{"body": "There is a restaurant near me called \"Pho King\"."
},                                           
{"body": "Username checks out. "
},                                           
{"body": "In line for pho? \nDoes that = ‘pho queue’? "
},                       
{"body": "I’m glad I’m not the only one. "
},                                           
{"body": "It fits really well actually"
},                                           
{"body": "I was like, “this person sucks at musical parody”"
},                                           
{"body": "Same! Came to the comments to check I wasn't the only one! "
},                                           
{"body": "I didn't realize what sub this was under, so I started reading the image to the tune of [By the Way by RHCP](https://www.youtube.com/watch?v=ayjDEbWF7f0) and got real ****ing confused when I hit the Alzeimer's bit since it stopped working. Also, I might be a little drunk. Hope everyone is having a good Friday night!"
},                       
{"body": "I have anxiety issues that contribute to my ADHD.  It’s awful trying to explain it to someone because it ranks up my anxiety and then my focus gets worse and it just spirals.  Those days I just kind of stare off into space and try fruitlessly to work.  \n\nIt’s not that I don’t care, I care so much that it’s all I can think of and now I’m paralyzed and dealing with tachycardia because I care so much."
},                                           
{"body": "I'm going to therapy for this right now. Growing up, no one understood why I did (or didn't) do the things I did, and how I was trying so hard and I couldn't get anything right. It still affects me to this day and I'm 31. I will forget something at work and it will be the end of the world for me.\n\nBut therapy is helping. Last week my therapist asked me what I would tell myself when I was a kid and unable to get people to understand me and my actions and I broke down...but it felt so great to tell that sad little kid that things get better. \n\nJust wanted to share since someone else knows what it was like growing up that way. &lt;333"
},                                           
{"body": "When I first saw Finding Nemo I, like most everyone, thought Dory's forgetfulness was comical. But after watching Finding Dory, I'll admit I cried when she explained the frustrations she endured because of her mental illness. And as someone with ADHD, there's almost nothing more heartbreaking than trying to explain to those you care about that *you're really trying* and that you *really do care* and don't forget things on purpose but they aren't willing to understand."
},                       
{"body": "This is phrased so beautifully. "
},                                           
{"body": "I wish I had money to give so she can have a frozen yogurt on me."
},                                           
{"body": "Watching my mother fade into the final phase of Alzheimer's I'm reminded of Carl Sagan's book, \"Dragons of Eden.\" It seems her frontal lobe - logic, control, purpose - is being peeled away to reveal the underlying limbic midbrain. She no longer knows her children or grandchildren. Only her fears, humor, joy, feisty spirit and love of frozen yogurt remain. Luckily for us her fun nature exceeds her worries and fears. While she has essentially already escaped the planet, her comet trail is still amazing."
},                       
{"body": "Time’s arrow marches forward."
},                                                                                                       
{"body": "times arrow changed my ****ing life "
},                                                                                   
{"body": "Coco was really beautiful, Finding Nemo/Dory is a fun movie and all, but Coco had such a heartwarming story that it really impacted me.\n\nAlso, while not for children, but the Netflix Original series BoJack Horseman deals heavily with his mothers progressing dementia, in a show that tackles a wide variety of mental health issues, the episode from his mothers perspective is one of the most terrifying representations of the disease I've seen in media.  "
},                                                               
{"body": "Coco!"
},                                           
{"body": "My sister brought home a book in first grade from the school library called Bringing Home Asthma. She didn't have asthma, but it had a picture of a kid and a dog on the front.\n\n\nShe thought asthma was the dog's name.\n\n\nEdit: I can't seem to find it, so maybe I'm forgetting the details and it was one of the pages that had a dog. Either way, we still being out up occasionally and laugh about it."
},                                           
{"body": "Nothing comes to mind other than Dory from Finding Nemo. "
},                                           
{"body": "Adventure Time!"
},                                           
{"body": "Coco. It's basically the entire plot. "
},                                           
{"body": "This is only tangentially related but I used to work in a place where I'd see a lot of off the wall books and one of them was, like, \"Why Did Grandma Put Her Underwear in the Refrigerator? Explaining Alzheimers to Children\".\n\nAnd it's like, man, there are so many more dignified, tactful ways you could approach that. I get wanting to lighten the subject matter up a bit but, maybe reel it in a bit. \n\nThat said are there any good cartoon interpretations of Alzheimers or Alzheimers-like symptoms?"
},                       
{"body": "My mum worked with a nurse (yes, a nurse) who called Alzheimer's \"old timers\" and Darth Vader \"Dark Raider\".  Never knew if my mum's coworker was being humorous or serious and just quirky. "
},                                           
{"body": "My grandmother had Alzheimer's, and when she was still lucid she sat down with me, my mother, and my grandfather and explained to six year old me what was going to happen, that she would always love me even though she might not remember who I was all the time.\n\nThe thing was, I misunderstood the word Alzheimer's and I was too nervous for clarification because I was six and this was serious so I thought she said old-timers disease, which kinda makes sense because old people seem to forget a lot of things like how old you are, so I just rolled with it."
},                       
{"body": "Get tested. They can tell if it’s genetic. Also, you can stave off the disease by staying mentally active. If your mother is worried about memory loss, she can perform exercises that will strengthen and maintain it, if only for a few years. "
},                                           
{"body": "Great grandma had Alzheimer's. Lived to 102.\n\nGrand mother had Alzheimer's. Lived to 94.\n\nMother is 63. She's terrified of any lapses in memory. I promise to take care of her, which helps. But we both worry when she forgets stuff. Is it the disease, or just a regular mistake? So far the latter... So it seems.\n\nI am 32. I've already told my SO that if my mind starts to go before my body does, I prefer to be euthanized. I hope a cure comes soon, but if it doesn't within my lifetime, I demand to die before my memories, my experiences over my life, do."
},                       
{"body": "I think my dad has it. He’s only 62. It’s gotten to a point it’s affected his work and he’s retiring- and he has called me to ask the same questions five days in a row and each day he was very anxious about the answers but acer spending an hour alleviating his anxiety the next day with the same inflection curiosity and anxiety he’d ask the same questions. The only reason he’s going to a doctor is I told him a doctor could fix it- he said he knew his memory was worsening but because the only possibility is a terminal illness he’d rather be blissfully ignorant. And I lied - or maybe not? What really is his prognosis "
},                                           
{"body": "Im doing some work on Alzheimer's... apparently bacteria and fungi are prevalent as ****. My grandfather died cause of those ****ing things. At least we are honing in hard on it. Less brain death, more global productivity. https://www.frontiersin.org/articles/10.3389/fnagi.2017.00195/full"
},                       
{"body": "and theres some rice on, a vermicelli bowl\n\nright away i knew that it was fusion\n\nBought egg rolls!"
},                                           
{"body": "That's exactly what popped in to my head! I thought we were about to get the ol' bamboozle, until Alzheimer's."
},                                           
{"body": "\"Standing in line for pho tonight\"\nhttps://www.youtube.com/watch?v=JnfyjwChuNU"
},                       
{"body": "I really hope that Ellen sees this somehow. She was insanely brave for coming out in the 90s . More than anyone else, she made it okay to be gay. Lately, I feel like she's more stressed/less easy-going on her shows and I think it may just be the craziness of the industry.\n\nAnyway, I hope that if she is fed-up, that she just retires and enjoys the life she earned. Her legacy is solid, as evidenced here."
},                       
{"body": "my brain started reading this to the beat of ‘by the way’ by the red hot chili peppers"
},                       
{"body": "Coping mechanisms are necessary for mental illness.  You’re always working around your issues and sometimes you find a new thing that helps."
},                                                                                                                                                                   
{"body": "I'd have to watch it again, but I think Dory does a lot of stuff besides just suddenly remembering. Like sometimes she remembers because she tries new techniques, which is what you often have to do when you have a mental illness especially like ADD for example. You can change your behavior to adapt and improve without \"stopping\" having ADD.\n\nI think when Dory stops trying to fight her memory loss is when she's able to overcome a lot of it. She also relies a lot on the people around her, it's not always her remembering something."
},                                                                                                                                               
{"body": "Except the show doesn't really accept Dory as she is, if she doesn't just suddenly stop being disabled at key times (including some other fish) they're just screwed...\n\nAnd Dory doesn't adapt, she just remembers... often for no good reason.\n\nOnly one of the fish actually bothers to adapt in a real way.  I think it was the near sighted whale, or fish."
},                                                                                                                           
{"body": "There was a larger lesson about accepting people as they are and having faith in yourself. Marlin has to learn to embrace who Dory is, Dory's parents believed in her, and she had to learn to believe in herself too. Even when she forgets things, she's able to adapt and still have success in her own way."
},                                                                                                       
{"body": "&gt; the whole lesson was \"Try really hard to not be disabled\".... \n\nMy life would have been a lot better had I seen that movie sooner. "
},                                                                                                       
{"body": "That was kinda a terrible movie though.   Dory just suddenly remembers when she needs to due to dumb luck or nonsense, the whole lesson was \"Try really hard to not be disabled\".... "
},                                                                                   
{"body": "And Dory has her own movie now \"Finding Dory\" based entirely off of her searching for her family despite her memory loss."
},                                                               
{"body": "Nemo is the son.  Marlin is the dad.  Nemo gets lost and Marlin is trying to find him.  He runs into Dory who is willing to help but has short term memory loss.  Every 15 seconds she forgets where she is and where they're going.\n\nHilarity ensues :)"
},                                                               
{"body": "&gt; as deep as i can go.\n\nhahaha"
},                                                               
{"body": "Finding nemo. Dory had major memory loss. Thats about as deep as i can go. It's been awhile."
},                                           
{"body": "&gt; I don't remember that movie\n\n&gt; I don't remember\n\n:thinking:"
},                                           
{"body": "The plot of the story is as follows: A father clownfish chases after his son who has been taken away by a research boat. He swims after it, and runs into Dory, who has short term memory loss. She claims to have seen it, and they continue on together hoping to find him. She keeps forgetting things, but has a better time remembering when the father is around, because he has overtime become her new family. Eventually the movie comes to a climax, where she expresses how frustrating it is to know she cannot remember important things despite really caring. They seperate after their frustrations grow to be too much, but because she cares about the father and in turn, his son, she remembers seeing the son and eventually they rescue him. Even though she forgot things a lot, she loved them both so much that she overcame her mental health challenges long enough to reunite the family.\n\nThe comparison here is that although Dory did not have Alzheimer's, she was suffering from a forgetful mental illness that she was aware of. For better or worse, if it were not for Dory, Marlin, the father, would never have found his son, Nemo.\n\nIn the case of this post, the dad was trying to show his son that even though Grandma couldn't remember him, it had no influence on their previous time together. She loved him then and still loves him now."
},                                           
{"body": "Neither does the father apparently. Hope it's not an early onset..."
},                                           
{"body": "I don't remember that movie. Someone please explain."
},                       
{"body": "This is such a great way to explain it\n\nIt hurt me so badly when my own grandma didn't recognize me months before my High School Graduation :( but I know she's watching over me :D"
},                       
{"body": "I remember when my grandfather finally admitted to me what was going on. I was 18 and visiting them for Christmas with my family when he asked me to check out the newest model ship he had been working on in his hobby room. In his excitement he had forgotten that he had placed pictures of every family member around his workbench with our names, how we were related, and a few facts about each of us written next to them. Still one of the most difficult moments in my life emotionally to this day. "
},                       
{"body": "He is a clown fish named Marlin :)"
},                                                                                   
{"body": "Pretty sure he's actually a clownfish, but it's been a while since I've seen the movie."
},                                                               
{"body": "Nemo's dad is Marlin for anyone wondering"
},                                           
{"body": "Nay but she became really good friends with them both and still loved little harpo!"
},                                           
{"body": "U never seen finding Dory?"
},                                           
{"body": "Dory went to find Nemo with Nemo’s dad, not Nemo"
},                       
{"body": "Ain't no shame in crying. So yeah, am crying :')"
},                                           
{"body": "Exactly "
},                                           
{"body": "I'm not crying YOU'RE crying!"
},                       
{"body": "I had to scroll all the way down for this. The post is fake af"
},                                           
{"body": "i think its fake. maybe a conversation like this has happened somewhere, but he sure as **** didn't overhear it waiting in line for pho."
},                                           
{"body": "Anyone else miss the actual memes or am I alone here? Also, this just genuinely feels pretty fake. Maybe its the writing or maybe its just me being cynical though"
},                       
{"body": "For sure never happened"
},                       
{"body": "I feel that using examples like these is the best way of explaining things to little things. They understand really quickly and connect with the problem/situation at a very high level."
},                       
{"body": "My dad probably has alzheimer’s, we will know soon. When I came out to him and my mom freaked out at me for several hours he turned to me and said “your mother seems upset but this is infinitely harder for you than for her.” Lately, he’s called me several times a week to ask me to alleviate his anxiety. Every time I calm him down and answer his questions, the next day he’s just as anxious and forgets what I’ve told him to calm him down- and asks the same questions again. It’s painful for me to see this happening to my best friend but I keep reminding myself that I should be patient and strong because it’s infinitely harder for him than for me"
},                                           
{"body": "I've been working as an in home caregiver the past 3 years for a elderly man who is turning 91 in a few weeks. His dementia is getting progressively worse and it's becoming more emotionally difficult for me. But this post is helpful. I try so hard to always be in the moment, be present, be patient. I think I'll print this out and put it by my computer in my room."
},                       
{"body": "My mother has Alzheimers and entered a nursing home this month. She still remembers family members, but there have been conversations where shes unsure quite how we're all related. \n\nThis has the feels. Doubly because \"nemo\". \n\nThank you. ❤️"
},                       
{"body": "My mom has dementia and it’s been eating away at me (and my family) how much and how quickly this very strong, sassy, loud and fiery independent woman is becoming less and less that. It’s new to me and the rest of my family and we are not coping well. Best we have done so far is to just try to be there for her and give her what she needs but **** dementia and Alzheimer’s just about the worst ****ing thing. Load of ****, it is. I’m sorry and I feel for anyone who has a family member that is going through this. Truly. "
},                       
{"body": "I mean this is nice and all but my great aunt didn't know who me or my dad was and started yelling and spitting on us.  It's not always as nice as everyone wants to make it. "
},                       
{"body": "So my great grandfather had alzheimers, and my last memory of him was when the whole family visited him on Christmas day a couple of years ago. At that point he had lost a lot weight as he forgot to eat and he was frail and oddly like ghost, the man he used to be seemed gone. There was no shimmer in his eyes anymore. We all ate some cake and drank coffee while we reminisced and I remember my grandmother telling me more about him and his life. So another important detail to this story is that I was the first boy in 2 generations in my family and than my great grandfather had always wanted a son or a grandson so when I was born he was thrilled. So as we were leaving we were all hugging each other saying goodbye and as I pulled away from the hug I had given him I could see the faintest smile in his eyes like he could still remember me ever so slightly. To this day I can't tell this story without tearing up, it's almost been 7 years now. "
},                       
{"body": "watch coco! I think it deals with it super super well"
},                                           
{"body": "[removed]"
},                       
{"body": "Finding Nemo did the heavy lifting in this explanation."
},                       
{"body": "Spot on.  I just my grandma two days ago. Her mind was going. She was never officially diagnosed as Alzheimers, it was more an old age thing. But lord, could it be painful. Sometimes she was sharp as a tack. Other times... What really hurts is I had a hard time seeing her in the assisted living home so i stopped visiting her.  The last time my brother saw her he said she kept calling him by my name. Im tearing up now writing about it.  I needed this because I know she loved me. And love her. Thats the bottom line. Its difficult because it gets confusing. Live your life folks.  The future is uncertain and tge end is always near.  "
},                       
{"body": "Alzheimer's is ****ing terrifying. Two years ago, my step-mother sometimes forgot what she went in to a room to do, or forgot that she already told someone about something. Today, she forgets who my father (her husband) is. I'm going on a week long vacation with them next month and I don't think she will know who I am.  I'm not really sure how to mentally prepare for that."
},                       
{"body": "My grandmother lived on the other side of the world in my parents native country. She came for some long periods to stay with us to help raise my brother and I while my parents worked. Being a diplomats wife, my grandmother had this grace and poise that I always admired. She taught me to read and write and I attribute a lot of my cool headed laid back demeanor to her influence (my mom was always high strung and nuts).\n\nFast forward to when I was 17, we went to my parents country to visit. My mom and relatives warned me that my grandmother had changed drastically over the years and was a shell of her former self. She had Alzheimer's for some time by then. I remember walking into her bedroom and I was completely taken aback. On the bed was a skeletal woman who had soft restraints on. Supposedly she would just kept scratching herself so they had to restrain her. She reverted back to her 9 year old self, and didn't recognize me or anyone in my family. I just began bawling. I never imagined a disease devastating such a wonderful woman so horribly. I then understood why people want the choice to end their life on their terms. She passed a few months after that visit, but it was a relief to all of us knowing she wasn't suffering anymore"
},                       
{"body": "Damn, I can't imagine what it would be like with Alzheimer's"
},                       
{"body": "Oof. This hurt. My mom (and, consequently, my dad) has been living with Alzheimer's since at least 2014. My dad wants our family to be close, so he pays to get me and my brothers' families out to California every June for a week. We do things. We make memories. We take pictures and have laughs and create experiences that won't be forgotten, for better or worse.  It's an experience every year, and every year I feel like I need to prep my boys on Grandma's potential behavior. It sucks.\n\nBut. Do you have any idea how hard it is to talk to your mom two weeks later and have her ask, \"Were you and your boys there? We had so much fun with (Brother 1)! And (Brother 2's) kids were so cute!\"\n\nIt hurts that I and my children are so forgettable.\n\nI'm terrified of what this summer will manifest. My kids' father passed away on Christmas and I'm worried my mom will say something hurtful about him because he cheated on me and I wouldn't live with that. But he wasn't a bad guy and regardless, he was their dad. ****. I don't want anyone to hurt anymore than they already have."
},                       
{"body": "This is so stupid"
},                       
{"body": "This is not a meme"
},                       
{"body": "I read the first line to the tune of By The Way by the Chili's."
},                       
{"body": "Bull\n\n****"
},                       
{"body": "Eli5 would love this"
},                       
{"body": "And then they all clapped"
},                       
{"body": "So are all tweets memes now? Is this what r/wholesomememes is now?"
},                       
{"body": "Holy sh*t master parent right here lvl 99"
},                       
{"body": "This right here is why it's important to represent different demographics in media."
},                       
{"body": "When I was 7 I had great grandparents who adored and doted over me when I was 6.  At 7...they had no clue who I was.\n\nThat hit me hard at 7, way before Finding Nemo came out, I wish I had this back then."
},                       
{"body": "I tried to read the first sentence to the tune of \"but the way\" by RHCP because of the phrasing"
},                       
{"body": "Damn, the power of pho"
},                       
{"body": "And that kid? *Chuckles* it was Benito Mussolini"
},                       
{"body": "The feels are real right now. Lost my Grandfather last night to Alzheimer’s and pneumonia last night. To be honest it was almost satisfying knowing that he wasn’t suffering anymore, it would be cruel to keep him like that. Let me tell you cherish the time you have with family because you never know how much you got left. \n\n****. Alzheimer’s."
}]          